In [1]:
import pandas as pd

df = pd.DataFrame(
    {"color": ["blue", "blue", "red", "red", "blue"], "value": [2, 1, 3, 3, 2]}
)

In [2]:
df

  color  value
0  blue      2
1  blue      1
2   red      3
3   red      3
4  blue      2

In [3]:
df.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [4]:
df.duplicated(keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [5]:
df.duplicated(keep=False)

0     True
1    False
2     True
3     True
4     True
dtype: bool

In [6]:
# locate duplicated rows 

df.loc[df.duplicated(), :]

  color  value
3   red      3
4  blue      2

In [8]:
# delete dupes

df.drop_duplicates()

  color  value
0  blue      2
1  blue      1
2   red      3

In [10]:
# specify column with dupes to remove

df.drop_duplicates(["value"])

  color  value
0  blue      2
1  blue      1
2   red      3